List<int> numbers = [];

List biologyTest = [
  {
    "question": "Если все медали на олимпийских играх вручили трем странам, сколько стран участвовало в соревнованиях?",
    "answers": [
      {"ans": "2", "score": 0},
      {"ans": "3", "score": 1},
      {"ans": "4", "score": 0},
      {"ans": "5", "score": 0}
    ]
  },
  {
    "question": "Какое наименьшее количество цветов нужно нарисовать на плоскости так, чтобы ни одна пара из них не была соединена прямой линией?",
    "answers": [
      {"ans": "3", "score": 1},
      {"ans": "4", "score": 0},
      {"ans": "5", "score": 0},
      {"ans": "6", "score": 0}
    ]
  },
  {
    "question": "Если 7 человек в 7 домах имеют по 7 кошек, и каждая кошка съедает 7 мышей за 7 минут, сколько всего ног у человек, кошек и мышей?",
    "answers": [
      {"ans": "196", "score": 0},
      {"ans": "294", "score": 0},
      {"ans": "392", "score": 1},
      {"ans": "490", "score": 0}
    ]
  },
  {
    "question": "Какое наименьшее число можно получить, перемещая всего две спички в римском числе IX, чтобы получилось число больше 6?",
    "answers": [
      {"ans": "0", "score": 0},
      {"ans": "2", "score": 1},
      {"ans": "4", "score": 0},
      {"ans": "6", "score": 0}
    ]
  },
  {
    "question":
        "Если каждый студент в классе знает 2 языка, и общее количество языков, которые они знают, равно 14, сколько студентов в классе?",
    "answers": [
      {"ans": "5", "score": 0},
      {"ans": "6", "score": 0},
      {"ans": "7", "score": 1},
      {"ans": "8", "score": 0}
    ]
  },
  {
    "question": "Сколько различных способов можно расставить буквы в слове 'ЛОГИКА'?",
    "answers": [
      {"ans": "360", "score": 0},
      {"ans": "720", "score": 1},
      {"ans": "1200", "score": 0},
      {"ans": "1440", "score": 0}
    ]
  },
  {
    "question":
        "Если 1 муха может съесть 3 куска сахара за 3 минуты, сколько кусков сахара может съесть 5 мух за 5 минут?",
    "answers": [
      {"ans": "5", "score": 0},
      {"ans": "15", "score": 1},
      {"ans": "25", "score": 0},
      {"ans": "75", "score": 0}
    ]
  },
  {
    "question": "Если 5 человек могут сделать 5 изделий за 5 дней, сколько времени потребуется 3 человекам, чтобы сделать 3 изделия?",
    "answers": [
      {"ans": "3 дня", "score": 1},
      {"ans": "5 дней", "score": 0},
      {"ans": "7 дней", "score": 0},
      {"ans": "9 дней", "score": 0}
    ]
  },
  {
    "question":
    "Вам нужно разрезать торт на 8 равных частей, используя только три разреза. Как это сделать?",
    "answers": [
      {"ans": "Сделать два пересекающихся разреза", "score": 1},
      {"ans": "Сделать три параллельных разреза", "score": 0},
      {"ans": "Сделать один диагональный разрез", "score": 0},
      {"ans": "Сделать два перпендикулярных разреза", "score": 0}
    ]
  },
  {
    "question":
    "Если 2 + 2 = 8, 3 + 3 = 18, 4 + 4 = 32, то 5 + 5 равно:",
    "answers": [
      {"ans": "45", "score": 0},
      {"ans": "50", "score": 0},
      {"ans": "55", "score": 0},
      {"ans": "60", "score": 1}
    ]
  },
  {
    "question":
    "Если 'HARD' равно 98, то какое число представляет 'SOFT'?",
    "answers": [
      {"ans": "74", "score": 0},
      {"ans": "80", "score": 0},
      {"ans": "86", "score": 0},
      {"ans": "92", "score": 1}
    ]
  },
];

List historyTest = [
  {
    "question":
        "Какое число идет следующим в последовательности: 2, 6, 12, 20, ...?",
    "answers": [
      {"ans": "22", "score": 0},
      {"ans": "26", "score": 1},
      {"ans": "32", "score": 0},
      {"ans": "40", "score": 0}
    ]
  },
  {
    "question":
        "Если красные ботинки стоят вдвое дешевле синих, а синие ботинки стоят 60 долларов, сколько стоят красные ботинки?",
    "answers": [
      {"ans": "20 долларов", "score": 1},
      {"ans": "30 долларов", "score": 0},
      {"ans": "40 долларов", "score": 0},
      {"ans": "50 долларов", "score": 0}
    ]
  },
  {
    "question":
        "Среди следующих слов выберите то, которое не подходит к остальным:",
    "answers": [
      {"ans": "Яблоко", "score": 0},
      {"ans": "Груша", "score": 0},
      {"ans": "Банан", "score": 0},
      {"ans": "Картошка", "score": 1}
    ]
  },
  {
    "question":
        "Какие буквы продолжат ряд: B, D, F, H, ...?",
    "answers": [
      {"ans": "J, K", "score": 0},
      {"ans": "I, K", "score": 1},
      {"ans": "G, I", "score": 0},
      {"ans": "G, K", "score": 0}
    ]
  },
  {
    "question":
    "Если 3 яйца стоят 30 центов, сколько стоит полдюжины яиц?",
    "answers": [
      {"ans": "45 центов", "score": 1},
      {"ans": "50 центов", "score": 0},
      {"ans": "60 центов", "score": 0},
      {"ans": "75 центов", "score": 0}
    ]
  },
  {
    "question":
    "Если 'CAT' равно 24, то 'DOG' равно:",
    "answers": [
      {"ans": "34", "score": 0},
      {"ans": "36", "score": 0},
      {"ans": "38", "score": 1},
      {"ans": "40", "score": 0}
    ]
  },
  {
    "question":
    "Какое число является результатом умножения 111 на 111?",
    "answers": [
      {"ans": "1111", "score": 0},
      {"ans": "12321", "score": 1},
      {"ans": "123321", "score": 0},
      {"ans": "13331", "score": 0}
    ]
  },
  {
    "question":
    "Какое слово не подходит к остальным в группе:",
    "answers": [
      {"ans": "Треугольник", "score": 0},
      {"ans": "Квадрат", "score": 0},
      {"ans": "Круг", "score": 0},
      {"ans": "Шестиугольник", "score": 1}
    ]
  },
  {
    "question":
    "Сколько букв 'E' в следующей строке: 'ELEPHANT IN THE ELEVATOR'?",
    "answers": [
      {"ans": "2", "score": 0},
      {"ans": "3", "score": 0},
      {"ans": "4", "score": 1},
      {"ans": "5", "score": 0}
    ]
  },
  {
    "question": " Если каждая собака имеет хвост, и Белла - собака, то что можно утверждать о Белле?",
    "answers": [
      {"ans": "У нее есть хвост", "score": 1},
      {"ans": "У нее нет хвоста", "score": 0},
      {"ans": "Нельзя определить", "score": 0},
      {"ans": "У Беллы есть крылья", "score": 0}
    ]
  }
];

List mathsTest = [
  {
    "question": "Чему равно произведение 7 и 9?",
    "answers": [
      {"ans": "56", "score": 0},
      {"ans": "63", "score": 1},
      {"ans": "72", "score": 0},
      {"ans": "81", "score": 0}
    ]
  },
  {
    "question": "Если a = 4 и b = 3, что будет результатом выражения 2a + b?",
    "answers": [
      {"ans": "9", "score": 0},
      {"ans": "10", "score": 0},
      {"ans": "11", "score": 1},
      {"ans": "12", "score": 0}
    ]
  },
  {
    "question": "Какое число является средним арифметическим 15, 25 и 35?",
    "answers": [
      {"ans": "20", "score": 1},
      {"ans": "25", "score": 0},
      {"ans": "30", "score": 0},
      {"ans": "35", "score": 0}
    ]
  },
  {
    "question": " Если сторона квадрата равна 6, каков его периметр?",
    "answers": [
      {"ans": "12", "score": 0},
      {"ans": "18", "score": 0},
      {"ans": "24", "score": 1},
      {"ans": "36", "score": 0}
    ]
  },
  {
    "question": "Решите уравнение: 3x - 7 = 14.?",
    "answers": [
      {"ans": "x = 3", "score": 0},
      {"ans": "x = 5", "score": 0},
      {"ans": "x = 9", "score": 0},
      {"ans": "x = 7", "score": 1}
    ]
  },
  {
    "question":
        "Какова площадь треугольника, если его основание 10, а высота 8?",
    "answers": [
      {"ans": "40", "score": 0},
      {"ans": "48", "score": 1},
      {"ans": "60", "score": 0},
      {"ans": "80", "score": 0}
    ]
  },
  {
    "question":
    "Если 20% числа равно 40, то что это за число?",
    "answers": [
      {"ans": "100", "score": 0},
      {"ans": "150", "score": 0},
      {"ans": "200", "score": 1},
      {"ans": "250", "score": 0}
    ]
  },
  {
    "question":
    "Какова сумма углов в прямоугольном треугольнике?",
    "answers": [
      {"ans": "90 градусов", "score": 0},
      {"ans": "180 градусов", "score": 0},
      {"ans": "270 градусов", "score": 0},
      {"ans": "360 градусов", "score": 1}
    ]
  },
  {
    "question":
    "Если x=2, то чему равно x^3?",
    "answers": [
      {"ans": "4", "score": 0},
      {"ans": "6", "score": 0},
      {"ans": "8", "score": 1},
      {"ans": "10", "score": 0}
    ]
  },
  {
    "question": "Какое число делится на 3 и 5, и наименьшее из чисел от 1 до 10?",
    "answers": [
      {"ans": "5", "score": 1},
      {"ans": "10", "score": 0},
      {"ans": "15", "score": 0},
      {"ans": "30", "score": 0}
    ]
  }
];
